In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\amdta\Desktop\Data Analytics Project\Customer_Behavior.csv")

In [3]:
df.head()

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchased_frequency_days
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,14,Venmo,Fortnightly,Middle_Aged,14
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,2,Cash,Fortnightly,Young_Adult,14
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,23,Credit Card,Weekly,Middle_Aged,7
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,49,PayPal,Weekly,Young_Adult,7
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,31,PayPal,Annually,Middle_Aged,365

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 19 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               3900 non-null   int64
 1   age                       3900 non-null   int64
 2   gender                    3900 non-null   object
 3   item_purchased            3900 non-null   object
 4   category                  3900 non-null   object
 5   purchase_amount           3900 non-null   int64
 6   location                  3900 non-null   object
 7   size                      3900 non-null   object
 8   color                     3900 non-null   object
 9   season                    3900 non-null   object
 10  review_rating             3900 non-null   float64
 11  subscription_status       3900 non-null   object
 12  shipping_type             3900 non-null   object
 13  discount_applied          3900 non-null   object
 14  previous_purchases        3900 non-null   int64
 15  payment_method            3900 non-null   object
 16  frequency_of_purchases    3900 non-null   object
 17  age_group                 3900 non-null   object
 18  purchased_frequency_days  3900 non-null   int64
dtypes: float64(1), int64(5), object(13)
memory usage: 579.0+ KB

In [5]:
df.describe()

,customer_id,age,purchase_amount,review_rating,previous_purchases,purchased_frequency_days
count,3900.000000,3900.000000,3900.000000,3900.000000,3900.000000,3900.000000
mean,1950.500000,44.068462,59.764359,3.750051,25.351538,89.133077
std,1125.977353,15.207589,23.685392,0.713590,14.447125,119.037566
min,1.000000,18.000000,20.000000,2.500000,1.000000,7.000000
25%,975.750000,31.000000,39.000000,3.100000,13.000000,14.000000
50%,1950.500000,44.000000,60.000000,3.800000,25.000000,30.000000
75%,2925.250000,57.000000,81.000000,4.400000,38.000000,90.000000
max,3900.000000,70.000000,100.000000,5.000000,50.000000,365.000000

In [6]:
df.isnull()

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchased_frequency_days
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3895,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3896,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3897,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3898,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3899,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [7]:
df.isnull().sum()

customer_id                 0
age                         0
gender                      0
item_purchased              0
category                    0
purchase_amount             0
location                    0
size                        0
color                       0
season                      0
review_rating               0
subscription_status         0
shipping_type               0
discount_applied            0
previous_purchases          0
payment_method              0
frequency_of_purchases      0
age_group                   0
purchased_frequency_days    0
dtype: int64

In [8]:
df["Review Rating"]=df.groupby("category")["review_rating"].transform(lambda x: x.fillna(x.median()))

In [9]:
df.isnull().sum()

customer_id                 0
age                         0
gender                      0
item_purchased              0
category                    0
purchase_amount             0
location                    0
size                        0
color                       0
season                      0
review_rating               0
subscription_status         0
shipping_type               0
discount_applied            0
previous_purchases          0
payment_method              0
frequency_of_purchases      0
age_group                   0
purchased_frequency_days    0
Review Rating               0
dtype: int64

In [10]:
df.columns = df.columns.str.lower()
df.columns= df.columns.str.replace(' ','_')

In [11]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchased_frequency_days',
       'review_rating'],
      dtype='object')

In [12]:
df=df.rename(columns={"purchase_amount_(usd)":"purchase_amount"})

In [13]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchased_frequency_days',
       'review_rating'],
      dtype='object')

In [14]:
## create a new column age_group
labels=['Young_Adult','Adult','Middle_Aged','Senior']
df['age_group']=pd.qcut(df['age'],q=4,labels=labels)

In [15]:
df[["age","age_group"]].head(10)

   age    age_group
0   55  Middle_Aged
1   19  Young_Adult
2   50  Middle_Aged
3   21  Young_Adult
4   45  Middle_Aged
5   46  Middle_Aged
6   63       Senior
7   27  Young_Adult
8   26  Young_Adult
9   57  Middle_Aged

In [16]:
## create a columnb purchased_frequency_days

frequency_mapping={
    'Fortnightly':14,
    "Weekly":7,
    "Monthly":30,
    "Quarterly":90,
    "Bi-Weekly":14,
    "Annually":365,
    "Every 3 Months":90
}
df['purchased_frequency_days']=df['frequency_of_purchases'].map(frequency_mapping)

In [17]:
df[['purchased_frequency_days','frequency_of_purchases']].head(10)

   purchased_frequency_days frequency_of_purchases
0                        14            Fortnightly
1                        14            Fortnightly
2                         7                 Weekly
3                         7                 Weekly
4                       365               Annually
5                         7                 Weekly
6                        90              Quarterly
7                         7                 Weekly
8                       365               Annually
9                        90              Quarterly

In [18]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchased_frequency_days',
       'review_rating'],
      dtype='object')

In [19]:
## connect to mysql
import mysql.connector
conn=mysql.connector.connect(
    host="localhost",
    user='root',
    password='tanveer@30',
    database='customer_behavior'
)
if conn.is_connected():
    print("connection is successfull")
cursor=conn.cursor()

cursor.execute('SELECT DATABASE();')
result=cursor.fetchone()
print("connected to database:",result[0])



cursor.close()
conn.close()

connection is successfull
connected to database: customer_behavior

In [20]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(
    "mysql+pymysql://root:tanveer%4030@localhost/customer_behavior"
)

In [21]:
## what is the total revenue generated by males vs female customers?

q1="select gender,sum(purchase_amount) as revenue from customer_behavior group by gender"
df1=pd.read_sql(q1,engine)
df1

   gender   revenue
0    Male  157890.0
1  Female   75191.0

In [22]:
## which customers used a discount but still spent mare than avg purchase amount?
q2="select customer_id,purchase_amount from customer_behavior where discount_applied='Yes' and purchase_amount>=(select avg(purchase_amount)from customer_behavior)"
df2=pd.read_sql(q2,engine)
df2

     customer_id  purchase_amount
0              2               64
1              3               73
2              4               90
3              7               85
4              9               97
..           ...              ...
834         1667               64
835         1671               73
836         1673               73
837         1674               62
838         1676               90

[839 rows x 2 columns]

In [46]:
## which are the top 5 products with the highest avg review rating ?
q3="select item_purchased, round(avg(review_rating),2) as avg_review_rating from customer_behavior group by item_purchased order by avg_review_rating desc limit 5;"
df3=pd.read_sql(q3,engine)
df3

  item_purchased  avg_review_rating
0         Gloves               3.86
1        Sandals               3.84
2          Boots               3.82
3            Hat               3.80
4        Handbag               3.78

In [47]:
## compare  the avg purchase amount between standard and express shipping ?
q4="select shipping_type, round(avg(purchase_amount),2)as avg_amount from customer_behavior where shipping_type in ('Express','Standard') group by shipping_type;"
df4=pd.read_sql(q4,engine)
df4

  shipping_type  avg_amount
0       Express       60.48
1      Standard       58.46

In [48]:
## do subscribed customers spend more ? 
## compare avg spent and total revenue between subscribers and non-subscribers?
q5="select subscription_status,count(customer_id) as total_customers,round(avg(purchase_amount),2) as avg_amount,round(sum(purchase_amount),2) as total_revenue from customer_behavior group by subscription_status order by total_revenue,avg_amount desc;"
df5=pd.read_sql(q5,engine)
df5

  subscription_status  total_customers  avg_amount  total_revenue
0                 Yes             1053       59.49        62645.0
1                  No             2847       59.87       170436.0

In [49]:
## which 5 products have the highest percentage of purchase with discount applied?
q6="select item_purchased,round(100*sum( case when discount_applied = 'Yes' then 1 else 0 end)/count(*) * 100,2) as discount_rate from customer_behavior group by item_purchased order by discount_rate desc limit 5;"
df6=pd.read_sql(q6,engine)
df6

  item_purchased  discount_rate
0            Hat        5000.00
1       Sneakers        4965.52
2           Coat        4906.83
3        Sweater        4817.07
4          Pants        4736.84

In [50]:
## segment the customers into new,returning and loyal based on their total numbeer of previous purchases and show the count of each segment?
q7="with customer_type as(select customer_id,previous_purchases,case when previous_purchases=1 then 'New' when previous_purchases between 2 and 10 then 'Returning'else 'Loyal'end as customer_segment from customer_behavior) select customer_segment,count(*) as 'Number of customers' from customer_type group by customer_segment;"
df7=pd.read_sql(q7,engine)
df7

  customer_segment  Number of customers
0            Loyal                 3116
1        Returning                  701
2              New                   83

In [53]:
## ## what are the top 3 most purchased products with in each category?
q8="with item_count as(select category,item_purchased,count(customer_id) as total_orders,row_number() over (partition by category order by count(customer_id) desc) as item_rank from customer_behavior group by category,item_purchased) select item_rank,category,item_purchased,total_orders from item_count where item_rank<=3;"
df8=pd.read_sql(q8,engine)
df8

    item_rank     category item_purchased  total_orders
0           1  Accessories        Jewelry           171
1           2  Accessories     Sunglasses           161
2           3  Accessories           Belt           161
3           1     Clothing         Blouse           171
4           2     Clothing          Pants           171
5           3     Clothing          Shirt           169
6           1     Footwear        Sandals           160
7           2     Footwear          Shoes           150
8           3     Footwear       Sneakers           145
9           1    Outerwear         Jacket           163
10          2    Outerwear           Coat           161

In [54]:
## are the customers who repeatbbuyers (more than 5 previous purchases) also likely to subscribe?
q9="select subscription_status,count(customer_id) as repeat_buyers from customer_behavior where previous_purchases>5 group by subscription_status;"
df9=pd.read_sql(q9,engine)
df9

  subscription_status  repeat_buyers
0                 Yes            958
1                  No           2518

In [55]:
## what is the revenue contribution of each age group?
q10="select age_group,sum(purchase_amount) as total_revenue from customer_behavior group by age_group order by total_revenue desc;"
df10=pd.read_sql(q10,engine)
df10

     age_group  total_revenue
0  Young_Adult        62143.0
1  Middle_Aged        59197.0
2        Adult        55978.0
3       Senior        55763.0